In [1]:
import pandas as pd

In [2]:
data = {
    'date' : ['2021-12-01', '01-12-2022', '2022/12/01', '12-01-2021'],
    'country' : ['USA', 'U.S.A', 'America', 'United States'],
    'name' : ['John Doe', 'Jonh Doe', 'Jane Doe', 'Jane Doe'],
    'sales_2020' : [100, 200, None, 200],
    'sales_2021' : [None, 150, 300, 150]
 }
# convert into pandas DataFrame

In [3]:
df = pd.DataFrame(data)

In [4]:
df.head()

         date        country      name  sales_2020  sales_2021
0  2021-12-01            USA  John Doe       100.0         NaN
1  01-12-2022          U.S.A  Jonh Doe       200.0       150.0
2  2022/12/01        America  Jane Doe         NaN       300.0
3  12-01-2021  United States  Jane Doe       200.0       150.0

In [5]:
# removing inconsistant date format
df['date'] = pd.to_datetime(df['date'], errors ='coerce')
df.head()

        date        country      name  sales_2020  sales_2021
0 2021-12-01            USA  John Doe       100.0         NaN
1        NaT          U.S.A  Jonh Doe       200.0       150.0
2        NaT        America  Jane Doe         NaN       300.0
3        NaT  United States  Jane Doe       200.0       150.0

In [6]:
df['date'] = df['date'].dt.strftime('%d-%m-%Y')
df.head()

         date        country      name  sales_2020  sales_2021
0  01-12-2021            USA  John Doe       100.0         NaN
1         NaN          U.S.A  Jonh Doe       200.0       150.0
2         NaN        America  Jane Doe         NaN       300.0
3         NaN  United States  Jane Doe       200.0       150.0

# Assignment: Impute fill the date and try another method to complete the date format inconsitencies

In [7]:
df['date'] = df['date'].ffill()
df.head()

         date        country      name  sales_2020  sales_2021
0  01-12-2021            USA  John Doe       100.0         NaN
1  01-12-2021          U.S.A  Jonh Doe       200.0       150.0
2  01-12-2021        America  Jane Doe         NaN       300.0
3  01-12-2021  United States  Jane Doe       200.0       150.0

In [8]:
# using a dictonary removeing the inconsistency in the country name
country_mapping = {
    'USA' : 'United States of America',
    'U.S.A' : 'United States of America',
    'America' : 'United States of America',
    'United States': 'United States of America'
}
df['country'] = df['country'].replace(country_mapping)

In [9]:
df.head()

         date                   country      name  sales_2020  sales_2021
0  01-12-2021  United States of America  John Doe       100.0         NaN
1  01-12-2021  United States of America  Jonh Doe       200.0       150.0
2  01-12-2021  United States of America  Jane Doe         NaN       300.0
3  01-12-2021  United States of America  Jane Doe       200.0       150.0

In [19]:
# imputing typing mistakes in the name
name_mapping = {
    'Jonh Doe' : 'John Doe'
}
df['name'] = df['name'].replace(name_mapping)

In [20]:
df['name']

0    John Doe
1    John Doe
2    Jane Doe
Name: name, dtype: object

In [21]:
df.head()

         date                   country      name  sales_2020  sales_2021
0  01-12-2021  United States of America  John Doe       100.0         NaN
1  01-12-2021  United States of America  John Doe       200.0       150.0
2  01-12-2021  United States of America  Jane Doe         NaN       300.0

In [22]:
# removing duplicataes
df.head()

         date                   country      name  sales_2020  sales_2021
0  01-12-2021  United States of America  John Doe       100.0         NaN
1  01-12-2021  United States of America  John Doe       200.0       150.0
2  01-12-2021  United States of America  Jane Doe         NaN       300.0

In [23]:
df = df.drop_duplicates(subset = 'name')

In [24]:
df.head()

         date                   country      name  sales_2020  sales_2021
0  01-12-2021  United States of America  John Doe       100.0         NaN
2  01-12-2021  United States of America  Jane Doe         NaN       300.0

In [25]:
# remoing contradictory data
df.head()

         date                   country      name  sales_2020  sales_2021
0  01-12-2021  United States of America  John Doe       100.0         NaN
2  01-12-2021  United States of America  Jane Doe         NaN       300.0

In [32]:
# let's suppose, sales_2020 always should be less than or equal to sales_2021
# Now, removig the contradictory data
data = {
    'date' : ['2021-12-01', '01-12-2022', '2022/12/01', '12-01-2021'],
    'country' : ['USA', 'U.S.A', 'America', 'United States'],
    'name' : ['John Doe', 'Jonh Doe', 'Jane Doe', 'Jane Doe'],
    'sales_2020' : [100, 200, None, 200],
    'sales_2021' : [None, 150, 300, 150]
 }
# convert into pandas DataFrame
df = pd.DataFrame(data)
df.head()

         date        country      name  sales_2020  sales_2021
0  2021-12-01            USA  John Doe       100.0         NaN
1  01-12-2022          U.S.A  Jonh Doe       200.0       150.0
2  2022/12/01        America  Jane Doe         NaN       300.0
3  12-01-2021  United States  Jane Doe       200.0       150.0

In [33]:
df = df.drop(df[df['sales_2020'] >= df['sales_2021']].index)

In [35]:
df.head()

         date  country      name  sales_2020  sales_2021
0  2021-12-01      USA  John Doe       100.0         NaN
2  2022/12/01  America  Jane Doe         NaN       300.0